# Series

## 基本概念

In [1]:
import numpy as np
import pandas as pd #导入全部
pd.Series([1,2])

0    1
1    2
dtype: int64

In [2]:
from pandas import Series,DataFrame #只导入单个
s=Series([3,4,5,6])
s

0    3
1    4
2    5
3    6
dtype: int64

In [6]:
type(s)

pandas.core.series.Series

In [8]:
s.values#获得值

array([3, 4, 5, 6], dtype=int64)

In [11]:
s.index #获得索引值

RangeIndex(start=0, stop=4, step=1)

In [26]:
s=Series([3,4,5,6],index=['a','b','c','d']) #指定索引
s

a    3
b    4
c    5
d    6
dtype: int64

In [27]:
s[1]  #指定索引把默认索引覆盖了

4

### 索引

In [10]:
s['b'] #索引，获得单个值

4

In [11]:
s.b

4

In [16]:
s.get('b')

4

In [12]:
s[1]   #默认索引

4

### 切片

In [13]:
s  #切片不会改变其数据类型

a    3
b    4
c    5
d    6
dtype: int64

In [15]:
s[['b']] #切片，切一个

b    4
dtype: int64

In [59]:
s['b'] #索引

4

In [16]:
s[['a','b']] #切片

a    3
b    4
dtype: int64

In [17]:
s

a    3
b    4
c    5
d    6
dtype: int64

In [25]:
s[1:3] #默认索引，左闭右开

b    4
c    5
dtype: int64

In [18]:
s['a':'c'] #指定索引切片，两边闭合

a    3
b    4
c    5
dtype: int64

In [24]:
s[['a','b']]  #选择，选择一个，选择多个

a    3
b    4
dtype: int64

In [19]:
s

a    3
b    4
c    5
d    6
dtype: int64

In [28]:
s.index[1]  #取索引值

'b'

### 选择和过滤

In [33]:
s=Series([3,4,5,6],index=['a','b','a','d']) #指定索引
s

a    3
b    4
a    5
d    6
dtype: int64

In [34]:
s['a']

a    3
a    5
dtype: int64

In [36]:
s[:2]

a    3
b    4
dtype: int64

In [35]:
s>3

a    False
b     True
a     True
d     True
dtype: bool

In [22]:
s[s>3]  #选择和过滤，把大于3的选出

b    4
a    5
d    6
dtype: int64

In [37]:
s

a    3
b    4
a    5
d    6
dtype: int64

In [38]:
s[s.index=='a'] #选择索引值为a的

a    3
a    5
dtype: int64

In [39]:
s[s.values == 6]  #选择索引值为6的

d    6
dtype: int64

## 序列的运算

### 序列运算保留索引

In [40]:
s=Series([3,4,5,6],index=['a','b','c','d']) #指定索引
s

a    3
b    4
c    5
d    6
dtype: int64

In [41]:
s1=s*2
s1

a     6
b     8
c    10
d    12
dtype: int64

In [73]:
np.exp(s1)

a       403.428793
b      2980.957987
c     22026.465795
d    162754.791419
dtype: float64

In [75]:
s1>8

a    False
b    False
c     True
d     True
dtype: bool

### 序列运算索引自动对齐

In [44]:
s1=Series([3,4,5,6],index=['a','b','c','d']) #指定索引
s2=Series([3,4,5,9],index=['b','a','d','c']) #指定索引

In [45]:
s1+s2

a     7
b     7
c    14
d    11
dtype: int64

In [46]:
#索引不存在，引入缺失值
s1=Series([3,4,5,6],index=['a','b','c','d']) #指定索引
s2=Series([3,4,5,6],index=['e','a','d','f']) #指定索引
s3=s1+s2
s3

a     7.0
b     NaN
c     NaN
d    11.0
e     NaN
f     NaN
dtype: float64

In [47]:
s3.isnull()  #缺失值的判断

a    False
b     True
c     True
d    False
e     True
f     True
dtype: bool

In [48]:
s3.isnull().values.sum() #统计有多少个缺失值

4

In [88]:
s3

a     7.0
b     NaN
c     NaN
d    11.0
e     NaN
f     NaN
dtype: float64

In [49]:
s3.notnull()

a     True
b    False
c    False
d     True
e    False
f    False
dtype: bool

In [51]:
s3[s3.notnull()]   #把非缺失值选出

a     7.0
d    11.0
dtype: float64

In [52]:
s3.notnull().sum() #统计非缺失值的数量

2

## 序列的创建

### 列表，元组

In [57]:
s1=Series([3,4,5,6],index=['a','b','c','d']) #列表，元组
s1

a    3
b    4
c    5
d    6
dtype: int64

In [55]:
s1=Series((3,4,5,6),index=['a','b','c','d']) #列表，元组
s1

a    3
b    4
c    5
d    6
dtype: int64

### 标量

In [59]:
s1=Series(5,index=['a','b','c','d']) #标量
s1

a    5
b    5
c    5
d    5
dtype: int64

### 数组

In [61]:
s1=Series(np.arange(1,5),index=['a','b','c','d']) #数组
s1

a    1
b    2
c    3
d    4
dtype: int32

In [62]:
s1.values

array([1, 2, 3, 4])

### 字典

In [64]:
dict1={'a':1,'b':3,'c':5,'d':8}
dict1

{'a': 1, 'b': 3, 'c': 5, 'd': 8}

In [65]:
s1=Series(dict1)  #不指定索引，默认以字典的key作为索引，字典值作为值
s1

a    1
b    3
c    5
d    8
dtype: int64

In [66]:
s1=Series(dict1,index=['c','d','e','f']) #指定索引，与标签对应的值拉出，缺少的元素用nan填充
s1

c    5.0
d    8.0
e    NaN
f    NaN
dtype: float64

In [107]:
s1=Series(dict1)  #不指定索引，默认以字典的key作为索引，字典值作为值
s1

a    1
b    3
c    5
d    8
dtype: int64

In [108]:
s1.index=['d','c','b','a']
s1

d    1
c    3
b    5
a    8
dtype: int64

# Dataframe

## dataframe的创建

### 二维列表创建

In [91]:
data1=[[1, 2, 3],[4, 5, 6],[7, 8, 9]] #二维列表创建,二维元组
d1=DataFrame(data1)
d1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [69]:
d1.index   # 行索引

RangeIndex(start=0, stop=3, step=1)

In [70]:
d1.columns   #列索引

RangeIndex(start=0, stop=3, step=1)

In [72]:
d1.values #取出值，numpy的二维数组

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]], dtype=int64)

In [73]:
d1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [74]:
d1.index=['a','b','c'] #创建dataframe后添加行索引和列索引
d1.columns=['one','two','three']
d1

   one  two  three
a    1    2      3
b    4    5      6
c    7    8      9

In [75]:
d1=DataFrame(data1,index=['a','b','c'],columns=['one','two','three']) #创建的时候加上行索引和列索引
d1

   one  two  three
a    1    2      3
b    4    5      6
c    7    8      9

In [76]:
type(d1)

pandas.core.frame.DataFrame

### 二维数组创建

In [77]:
df2=DataFrame(np.arange(16).reshape((4,4))) #数组转换为dataframe
df2

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### 等长列表、 元组、 数组、 序列组成的字典

In [85]:
data1={'c':['1','2'],'a':['5','6']} #把key抽出形成columns
DataFrame(data1)

   c  a
0  1  5
1  2  6

In [79]:
data1={'c':('1','2'),'a':('5','6')}
DataFrame(data1)

   c  a
0  1  5
1  2  6

In [128]:
data1={'c':np.arange(4),'a':np.arange(4)}
DataFrame(data1)

   c  a
0  0  0
1  1  1
2  2  2
3  3  3

In [83]:
data1={'c':Series([1,2]),'a':Series([3,4,5])} #序列可以不等长
DataFrame(data1)

     c  a
0  1.0  3
1  2.0  4
2  NaN  5

### 字典组成的字典

In [87]:
nest_dict={'shanghai':{2015:100,2016:101},'beijing':{2015:102,2016:103,2017:109}}
DataFrame(nest_dict)  #外层的key形成columns，里层的key成为index

      shanghai  beijing
2015     100.0      102
2016     101.0      103
2017       NaN      109

### 字典或Series的列表

In [88]:
data = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
DataFrame(data) #key抽出形成columns

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [90]:
data2 = [Series([1, 2],index=['a','b']), Series([5,6],index=['a','b'])]
DataFrame(data2)  #index抽出形成columns

   a  b
0  1  2
1  5  6

## 数据的加载和查看

### 数据的读写

#### csv文件

In [93]:
data1=[[1, 2, 3],[4, 5, 6],[7, 8, 9]] #二维列表创建,二维元组
d1=DataFrame(data1,index=['a','b','c'],columns=['one','two','three']) #创建的时候加上行索引和列索引
d1

   one  two  three
a    1    2      3
b    4    5      6
c    7    8      9

In [94]:
d1.to_csv('out1.csv',sep=',', header=True) #写入csv,带header

In [95]:
d1.to_csv('out2.csv',sep=',', header=False) #写入csv,不带header

In [111]:
d2=pd.read_csv('out1.csv')
d2

  Unnamed: 0  one  two  three
0          a    1    2      3
1          b    4    5      6
2          c    7    8      9

In [112]:
d3=d2.set_index('Unnamed: 0')
d3

            one  two  three
Unnamed: 0
a             1    2      3
b             4    5      6
c             7    8      9

In [113]:
d3.index.name=''  #把索引的名字去掉
d3

   one  two  three

a    1    2      3
b    4    5      6
c    7    8      9

In [146]:
pd.read_csv?

In [97]:
pd.read_csv('out2.csv',header=None,names=['one','two','three','four']) #可以通过name加columns

  one  two  three  four
0   a    1      2     3
1   b    4      5     6
2   c    7      8     9

In [99]:
pd.read_csv(r'D:\CDA\Dataclearing\数据分析精英班\numpy和pandas\iris.csv')

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

#### excel文件

In [104]:
d2=pd.read_excel(r'D:\CDA\Dataclearing\数据分析精英班\numpy和pandas\file\test.xlsx') #读
d2.head(5) #查看前5行

    姓名  课程  成绩
0   孙志  英语  75
1   孙志  语文  58
2   孙志  英语  90
3   孙志  数学  89
4  赵昀艳  数学  28

In [3]:
d2=pd.read_excel(r'file\test.xlsx') #读
d2.head(5) #查看前5行

    姓名  课程  成绩
0   孙志  英语  75
1   孙志  语文  58
2   孙志  英语  90
3   孙志  数学  89
4  赵昀艳  数学  28

In [137]:
#写进多个sheet里面
with pd.ExcelWriter('output.xlsx') as writer:  # doctest: +SKIP
    d2.to_excel(writer, index=False,sheet_name='1')
    d3.to_excel(writer, index=False,sheet_name='2')

In [5]:
d2.to_excel?

#### clipboard文件读取

In [130]:
d3=pd.read_clipboard() #从粘贴板粘贴数据
d3

           日期    名称   相关链接                        研报  评级    机构
0  2020-07-17  锐明技术  股吧 详细     重大事件快评：中报业绩超预期，产业升...  买入  国信证券
1  2020-07-17  中国长城  股吧 详细           中报预告亏损，Q2业绩明显改善   -  信达证券
2  2020-07-17  德赛西威  股吧 详细         软件定义汽车视角下值得长期看好吗？  买入  东吴证券
3  2020-07-17  顺丰控股  股吧 详细                 成长龙头，价值优选  买入  国信证券
4  2020-07-17  康龙化成  股吧 详细  半年度业绩预告点评：2020H1业绩维持高...  买入  万联证券

In [131]:
d3.to_excel('test1.xlsx',sheet_name='2') #写

#### 从网页读取数据

In [114]:
d4=pd.read_html('https://stock.eastmoney.com/') #读
d4

[  代码 名称 相关链接 最新价 涨跌幅 振幅 成交额 换手率
 0  -  -    -   -   -  -   -   -
 1  -  -    -   -   -  -   -   -
 2  -  -    -   -   -  -   -   -
 3  -  -    -   -   -  -   -   -,   代码 名称 相关链接 最新价 涨跌幅 振幅 成交额 换手率
 0  -  -    -   -   -  -   -   -
 1  -  -    -   -   -  -   -   -
 2  -  -    -   -   -  -   -   -
 3  -  -    -   -   -  -   -   -, Empty DataFrame
 Columns: [代码, 名称, 涨跌幅, 最新价]
 Index: [], Empty DataFrame
 Columns: [代码, 名称, 涨跌幅, 最新价]
 Index: [], Empty DataFrame
 Columns: [板块名称, 相关链接, 最新价, 涨跌额, 涨跌幅, 主力净流入, 领涨股, 涨跌幅.1]
 Index: [],            日期    名称   相关链接                        研报  评级    机构
 0  2020-07-17  锐明技术  股吧 详细     重大事件快评：中报业绩超预期，产业升...  买入  国信证券
 1  2020-07-17  中国长城  股吧 详细           中报预告亏损，Q2业绩明显改善   -  信达证券
 2  2020-07-17  德赛西威  股吧 详细         软件定义汽车视角下值得长期看好吗？  买入  东吴证券
 3  2020-07-17  顺丰控股  股吧 详细                 成长龙头，价值优选  买入  国信证券
 4  2020-07-17  康龙化成  股吧 详细  半年度业绩预告点评：2020H1业绩维持高...  买入  万联证券,            日期    名称   相关链接     涨跌幅  龙虎榜净买额(万)              上榜原因
 0  2020-07-17  航发控制  股吧 详细  10.02%   12573.63  日涨幅偏离值达到7%的前五...
 1  2020-07-17  英科医疗  股吧 详细   2.48%   10521.38  日振幅值达到15%的前五只...
 2  2020-07-17  三全食品  股吧 详细  10.01%   10033.66  日涨幅偏离值达到7%的前五...
 3  2020-07-17  康华生物  股吧 详细   7.39%    7548.27  日振幅值达到15%的前五只...
 4  2020-07-17  康华生物  股吧 详细   7.39%    7548.27  日换手率达到20%的前五只...,            日期    名称   相关链接    涨跌幅                         行业研报
 0  2020-07-17  航天航空  股吧 详情  3.38%  航空运输行业专题研究：从美国西南航空看春秋航空的...
 1  2020-07-17  旅游酒店  股吧 详情  2.62%                2019年中国冰雪行业概览
 2  2020-07-17  家电行业  股吧 详情  0.84%  家电轻工：6月地产新开工高增‚家电快速恢复‚轻工...
 3  2020-07-17  水泥建材  股吧 详情  1.73%  建材Ⅲ6月数据：短期雨水扰动供需‚旺季需求集中释...
 4  2020-07-17  环保工程  股吧 详情  2.59%  环保工程及服务行业：国家绿色发展基金入驻国家环境...
 5  2020-07-13  木业家具  股吧 详情  0.68%  轻工制造行业周观点报告：半年度业绩预告陆续发布‚..., Empty DataFrame
 Columns: [排行, 名称, 相关链接, 5日涨跌幅, 5日主力净流入, 5日超大单净流入, 5日大单净流入]
 Index: [], Empty DataFrame
 Columns: [排行, 名称, 相关链接, 10日涨跌幅, 10日主力净流入, 10日超大单净流入, 10日大单净流入]
 Index: [], Empty DataFrame
 Columns: [排行, 名称, 相关链接, 今日涨跌幅, 今日主力净流入, 今日超大单净流入, 今日大单净流入]
 Index: [], Empty DataFrame
 Columns: [排行, 名称, 相关链接, 5日涨跌幅, 5日主力净流入, 5日超大单净流入, 5日大单净流入]
 Index: [], Empty DataFrame
 Columns: [排行, 名称, 相关链接, 10日涨跌幅, 10日主力净流入, 10日超大单净流入, 10日大单净流入]
 Index: [],        代码    名称      相关链接  持有基金家数  持股总数(万股) 持股变化      持股变动数
 0  600519  贵州茅台  详情 股吧 档案     175    583.35   减持  -51963565
 1     858   五粮液  详情 股吧 档案     164   4466.44   减持 -237853565
 2    2475  立讯精密  详情 股吧 档案     139  16577.04   减持 -593156022
 3  300750  宁德时代  详情 股吧 档案     123   2537.91   减持  -85830342
 4  600036  招商银行  详情 股吧 档案     110   8150.63   减持 -758705998
 5  601318  中国平安  详情 股吧 档案     108   4831.20   减持 -551945941,        代码    名称   相关链接    申购代码   发行量(万股)    发行价        申购日期  发行市盈率
 0  603408  建霖家居  详情 股吧  732408   4500.00  15.53  07-20 (周一)  22.98
 1  605118  力鼎光电  详情 股吧  707118   4100.00   9.28  07-20 (周一)  22.99
 2  688050  爱博医疗  详情 股吧  787050   2629.00  33.55  07-20 (周一)  55.55
 3  601456  国联证券  详情 股吧  780456  47571.90   4.25  07-21 (周二)  19.60
 4  605222  起帆电缆  详情 股吧  707222   5000.00  18.43  07-21 (周二)  22.99
 5  605318   法狮龙  详情 股吧  707318   3229.28  13.09  07-21 (周二)  22.99, Empty DataFrame
 Columns: [排名, 代码, 名称, 相关链接, 最新价, 涨跌幅, 振幅, 成交量(手), 成交额]
 Index: [],    B股名称    B股代码    A股代码  AB股价格比
 0  东信B股  900941  600776    4.64
 1  凤凰B股  900916  600679    4.39
 2   宝信B  900926  600845    3.92
 3  绿庭B股  900919  600695    3.91
 4  锦江B股  900934  600754    3.61,      B股名称    B股代码  A股代码  AB股价格比
 0  *ST中华B  200017  1872   18.93
 1     皇庭B  200056    25   13.83
 2    深南电B  200037    37    4.57
 3    深赛格B  200058    58    4.00
 4    深华发B  200020    20    3.97, Empty DataFrame
 Columns: [代码, 简称, 成交价, 涨跌幅]
 Index: [], Empty DataFrame
 Columns: [名称, 现价, 涨跌, 涨跌幅, 最高价, 最低价, 成交额, 持仓量(手), 昨结算]
 Index: [], Empty DataFrame
 Columns: [H股代码, 名称, 相关链接, 现价(HKD), 涨跌幅, A股代码, A现价(RMB), A比价]
 Index: [], Empty DataFrame
 Columns: [名称, 最新, 涨跌额, 涨跌幅, 最高, 最低, 开盘, 昨收]
 Index: [], Empty DataFrame
 Columns: [序号, 名称, 最新价(美元), 涨跌额, 涨跌幅, 昨收, 市值(美元), 市盈率]
 Index: [], Empty DataFrame
 Columns: [名称, 最新, 涨跌额, 涨跌幅, 最高, 最低, 开盘, 昨收]
 Index: []]

In [115]:
len(d4)

24

In [123]:
d4[5]

           日期    名称   相关链接                        研报  评级    机构
0  2020-07-17  锐明技术  股吧 详细     重大事件快评：中报业绩超预期，产业升...  买入  国信证券
1  2020-07-17  中国长城  股吧 详细           中报预告亏损，Q2业绩明显改善   -  信达证券
2  2020-07-17  德赛西威  股吧 详细         软件定义汽车视角下值得长期看好吗？  买入  东吴证券
3  2020-07-17  顺丰控股  股吧 详细                 成长龙头，价值优选  买入  国信证券
4  2020-07-17  康龙化成  股吧 详细  半年度业绩预告点评：2020H1业绩维持高...  买入  万联证券

### 数据的查看

In [15]:
d2=pd.read_excel(r'file\test.xlsx') #读
d2.head(3) #查看前5行

   姓名  课程  成绩
0  孙志  英语  75
1  孙志  语文  58
2  孙志  英语  90

In [11]:
d2.tail(3) #查看尾部几行

      姓名  课程  成绩
197  赵伟艳  英语  96
198  李东艳  语文  26
199  钱昀艳  语文  24

In [30]:
d2.sample(n=4,random_state=10) #随机的抽取,可以固定种子

      姓名  课程  成绩
59   李琛志  语文  61
5    赵琛志  语文  76
20    钱坤  数学  68
198  李东艳  语文  26

In [31]:
d2.shape #形状

(200, 3)

In [33]:
d2.info() #数据缺失情况，数据类型

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   姓名      200 non-null    object
 1   课程      200 non-null    object
 2   成绩      200 non-null    int64
dtypes: int64(1), object(2)
memory usage: 4.8+ KB

In [38]:
d2.iloc[0:2,2]=np.nan
d2.iloc[0:2,1]=np.nan  #把一些值设置为缺失

In [39]:
d2.head()

    姓名   课程    成绩
0   孙志  NaN   NaN
1   孙志  NaN   NaN
2   孙志   英语  90.0
3   孙志   数学  89.0
4  赵昀艳   数学  28.0

In [43]:
d2['姓名'][0]

'孙志'

In [44]:
d2['课程'][0]

nan

In [45]:
d2['课程'][2]

'英语'

In [48]:
d2.info()  #数据类型，缺失值

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   姓名      200 non-null    object
 1   课程      198 non-null    object
 2   成绩      198 non-null    float64
dtypes: float64(1), object(2)
memory usage: 4.8+ KB

In [49]:
d2.dtypes  #查看数据类型

姓名     object
课程     object
成绩    float64
dtype: object

In [52]:
d2.head()

    姓名   课程    成绩
0   孙志  NaN   NaN
1   孙志  NaN   NaN
2   孙志   英语  90.0
3   孙志   数学  89.0
4  赵昀艳   数学  28.0

In [54]:
d2.describe() #针对数值型的，统计描述信息，非空的信息

               成绩
count  198.000000
mean    50.595960
std     28.195985
min      0.000000
25%     26.250000
50%     52.000000
75%     74.000000
max    100.000000

In [64]:
d2.describe(include= object) #统计信息

         姓名   课程
count   200  198
unique   55    3
top      钱坤   数学
freq     13   69

In [61]:
d2.describe(include= 'all') #统计全部信息

         姓名   课程          成绩
count   200  198  198.000000
unique   55    3         NaN
top      钱坤   数学         NaN
freq     13   69         NaN
mean    NaN  NaN   50.595960
std     NaN  NaN   28.195985
min     NaN  NaN    0.000000
25%     NaN  NaN   26.250000
50%     NaN  NaN   52.000000
75%     NaN  NaN   74.000000
max     NaN  NaN  100.000000

In [66]:
data1=[[1, 2, 3],[4, 5, 6],[7, 8, 9]] #二维列表创建,二维元组
d1=DataFrame(data1,index=['a','b','c'],columns=['one','two','three']) #创建的时候加上行索引和列索引
d1

   one  two  three
a    1    2      3
b    4    5      6
c    7    8      9

In [74]:
d1.describe?

In [75]:
d1[['one','three']].describe()

       one  three
count  3.0    3.0
mean   4.0    6.0
std    3.0    3.0
min    1.0    3.0
25%    2.5    4.5
50%    4.0    6.0
75%    5.5    7.5
max    7.0    9.0

In [77]:
d2.head()

    姓名   课程    成绩
0   孙志  NaN   NaN
1   孙志  NaN   NaN
2   孙志   英语  90.0
3   孙志   数学  89.0
4  赵昀艳   数学  28.0

In [88]:
d2['姓名'].value_counts() #统一某一列的数量

钱坤     13
孙艳     12
赵艳     10
孙志     10
孙坤      9
李坤      9
赵志      8
赵坤      8
李志      7
李艳      6
钱艳      6
钱伟坤     6
赵琛志     5
赵东艳     5
李东艳     5
钱志      5
李伟志     4
赵伟艳     4
钱昀志     4
孙东艳     4
赵琛艳     4
孙琛坤     3
赵昀坤     3
赵伟志     3
李昀艳     3
李伟坤     2
赵东志     2
钱东志     2
孙东坤     2
赵昀艳     2
李东坤     2
赵昀志     2
李琛艳     2
赵琛坤     2
李琛志     2
钱琛艳     2
钱琛坤     2
李伟艳     2
钱昀艳     2
孙昀艳     1
李昀坤     1
孙琛志     1
李东志     1
孙伟志     1
孙昀坤     1
赵东坤     1
李昀志     1
李琛坤     1
钱伟艳     1
孙伟艳     1
孙昀志     1
钱伟志     1
孙琛艳     1
孙东志     1
钱东艳     1
Name: 姓名, dtype: int64

In [90]:
d2['课程'].unique() #课程这一列不重复的

array([nan, '英语', '数学', '语文'], dtype=object)

In [91]:
d2['课程'].nunique() #课程这一列不重复的数量

3

## 索引和过滤

### 序列的索引和过滤

#### 索引

In [92]:
s=Series([3,4,5,6],index=['a','b','c','d']) #指定索引
s

a    3
b    4
c    5
d    6
dtype: int64

In [186]:
s.b

4

In [193]:
s[['a','c','d']]

a    3
c    5
d    6
dtype: int64

In [93]:
s['a':'c'] #两边闭合

a    3
b    4
c    5
dtype: int64

In [94]:
s[1:3] #左闭右开

b    4
c    5
dtype: int64

In [101]:
s.iloc[1:3] #默认索引，隐式

b    4
c    5
dtype: int64

In [188]:
s['a':'c']

a    3
b    4
c    5
dtype: int64

In [99]:
s.loc['a':'c'] #指定索引，显示

a    3
b    4
c    5
dtype: int64

#### 过滤

In [145]:
s

a    3
b    4
c    5
d    6
dtype: int64

In [148]:
s[s>4] #选择大于4

c    5
d    6
dtype: int64

In [97]:
s[(s>4)&(s<6)]

c    5
dtype: int64

### dataframe的索引和过滤

In [103]:
import numpy as np
np.random.seed(10)
df = DataFrame(np.random.rand(6,4)*2-1)
df.index = ['a', 'b', 'c', 'd', 'e', 'f']
df.columns = ['A', 'B', 'C', 'D']
df

          A         B         C         D
a  0.542641 -0.958496  0.267296  0.497608
b -0.002986 -0.550407 -0.603874  0.521061
c -0.661778 -0.823320  0.370720  0.906787
d -0.992103  0.024385  0.625242  0.225052
e  0.443511 -0.416248  0.835548  0.429152
f  0.085089 -0.715660 -0.253318  0.348267

#### 索引

##### 选择一行和多行

###### 隐式的选择

In [135]:
#选择行
df[0:1] #选择第一行，默认的索引选择行，隐式

          A         B         C         D
a  0.542641 -0.958496  0.267296  0.497608

In [108]:
df[1:3] #选择多行,左闭右开

          A         B         C         D
b -0.002986 -0.550407 -0.603874  0.521061
c -0.661778 -0.823320  0.370720  0.906787

In [109]:
df[2::2] #选择多行,左闭右开

          A         B         C         D
c -0.661778 -0.823320  0.370720  0.906787
e  0.443511 -0.416248  0.835548  0.429152

###### 显示的选择行

In [110]:
df['a':'a'] #选择一行

          A         B         C         D
a  0.542641 -0.958496  0.267296  0.497608

In [120]:
df['a':'c':2] #选择多行,指定的索引选择多行,两边闭合

          A         B         C         D
a  0.542641 -0.958496  0.267296  0.497608
c -0.661778 -0.823320  0.370720  0.906787

##### 选择列

In [112]:
#选择列
df

          A         B         C         D
a  0.542641 -0.958496  0.267296  0.497608
b -0.002986 -0.550407 -0.603874  0.521061
c -0.661778 -0.823320  0.370720  0.906787
d -0.992103  0.024385  0.625242  0.225052
e  0.443511 -0.416248  0.835548  0.429152
f  0.085089 -0.715660 -0.253318  0.348267

In [113]:
df['A']  #选出的是序列

a    0.542641
b   -0.002986
c   -0.661778
d   -0.992103
e    0.443511
f    0.085089
Name: A, dtype: float64

In [114]:
df[['A']] #选择一列，dataframe

          A
a  0.542641
b -0.002986
c -0.661778
d -0.992103
e  0.443511
f  0.085089

In [260]:
df[['A','C','B']] #选择多列

          A         C         B
a  0.542641  0.267296 -0.958496
b -0.002986 -0.603874 -0.550407
c -0.661778  0.370720 -0.823320
d -0.992103  0.625242  0.024385
e  0.443511  0.835548 -0.416248
f  0.085089 -0.253318 -0.715660

In [118]:
#把值选出
df[['A']].values

array([[ 0.54264129],
       [-0.00298598],
       [-0.66177833],
       [-0.99210347],
       [ 0.44351063],
       [ 0.08508874]])

In [119]:
df.values

array([[ 0.54264129, -0.9584961 ,  0.26729647,  0.49760777],
       [-0.00298598, -0.55040671, -0.60387427,  0.52106142],
       [-0.66177833, -0.82332037,  0.37071964,  0.90678669],
       [-0.99210347,  0.02438453,  0.62524192,  0.22505213],
       [ 0.44351063, -0.41624786,  0.83554825,  0.42915157],
       [ 0.08508874, -0.7156599 , -0.25331848,  0.34826723]])

##### 行，列的选择,loc方式,用指定的索引

In [121]:
#行，列的选择,loc方式,显示方式
df

          A         B         C         D
a  0.542641 -0.958496  0.267296  0.497608
b -0.002986 -0.550407 -0.603874  0.521061
c -0.661778 -0.823320  0.370720  0.906787
d -0.992103  0.024385  0.625242  0.225052
e  0.443511 -0.416248  0.835548  0.429152
f  0.085089 -0.715660 -0.253318  0.348267

In [123]:
df.loc['a':'c','A':'D'] #两边都是闭合

          A         B         C         D
a  0.542641 -0.958496  0.267296  0.497608
b -0.002986 -0.550407 -0.603874  0.521061
c -0.661778 -0.823320  0.370720  0.906787

In [124]:
df.loc['a':'c':2,'A':'D':2]

          A         C
a  0.542641  0.267296
c -0.661778  0.370720

In [262]:
df.loc['a':'c',['A','D']] #选择多行和多列,指定的索引和列名

          A         D
a  0.542641  0.497608
b -0.002986  0.521061
c -0.661778  0.906787

In [217]:
df.loc[:,['A','B']] #选择多行和多列

          A         B
a  0.542641 -0.958496
b -0.002986 -0.550407
c -0.661778 -0.823320
d -0.992103  0.024385
e  0.443511 -0.416248
f  0.085089 -0.715660

In [175]:
df.loc[['a','c'],['A','D']]  #固定的选择某一行，某一列

          A         D
a  0.542641  0.497608
c -0.661778  0.906787

In [ ]:
df

##### iloc方式选择多行和多列，用默认的索引

In [128]:
df

          A         B         C         D
a  0.542641 -0.958496  0.267296  0.497608
b -0.002986 -0.550407 -0.603874  0.521061
c -0.661778 -0.823320  0.370720  0.906787
d -0.992103  0.024385  0.625242  0.225052
e  0.443511 -0.416248  0.835548  0.429152
f  0.085089 -0.715660 -0.253318  0.348267

In [129]:
df.iloc[:,[0,2]]

          A         C
a  0.542641  0.267296
b -0.002986 -0.603874
c -0.661778  0.370720
d -0.992103  0.625242
e  0.443511  0.835548
f  0.085089 -0.253318

In [132]:
df.iloc[0:2,0:2] #指定范围

          A         B
a  0.542641 -0.958496
b -0.002986 -0.550407

In [230]:
df.iloc[2:4]

          A         B         C         D
c -0.661778 -0.823320  0.370720  0.906787
d -0.992103  0.024385  0.625242  0.225052

#### 过滤

In [138]:
df

          A         B         C         D
a  0.542641 -0.958496  0.267296  0.497608
b -0.002986 -0.550407 -0.603874  0.521061
c -0.661778 -0.823320  0.370720  0.906787
d -0.992103  0.024385  0.625242  0.225052
e  0.443511 -0.416248  0.835548  0.429152
f  0.085089 -0.715660 -0.253318  0.348267

In [152]:
df[df>0]  # 选择大于零的所有数据,不符合要求的填充缺失值

          A         B         C         D
a  0.542641       NaN  0.267296  0.497608
b       NaN       NaN       NaN  0.521061
c       NaN       NaN  0.370720  0.906787
d       NaN  0.024385  0.625242  0.225052
e  0.443511       NaN  0.835548  0.429152
f  0.085089       NaN       NaN  0.348267

In [153]:
df

          A         B         C         D
a  0.542641 -0.958496  0.267296  0.497608
b -0.002986 -0.550407 -0.603874  0.521061
c -0.661778 -0.823320  0.370720  0.906787
d -0.992103  0.024385  0.625242  0.225052
e  0.443511 -0.416248  0.835548  0.429152
f  0.085089 -0.715660 -0.253318  0.348267

In [154]:
#选择a行大于0的所有列
df.loc['a']>0

A     True
B    False
C     True
D     True
Name: a, dtype: bool

In [285]:
df.loc[:,df.loc['a']>0]

          A         C         D
a  0.542641  0.267296  0.497608
b -0.002986 -0.603874  0.521061
c -0.661778  0.370720  0.906787
d -0.992103  0.625242  0.225052
e  0.443511  0.835548  0.429152
f  0.085089 -0.253318  0.348267

In [155]:
df

          A         B         C         D
a  0.542641 -0.958496  0.267296  0.497608
b -0.002986 -0.550407 -0.603874  0.521061
c -0.661778 -0.823320  0.370720  0.906787
d -0.992103  0.024385  0.625242  0.225052
e  0.443511 -0.416248  0.835548  0.429152
f  0.085089 -0.715660 -0.253318  0.348267

In [156]:
#选择A列里面大于零的所有行
df['A']>0

a     True
b    False
c    False
d    False
e     True
f     True
Name: A, dtype: bool

In [157]:
df.loc[df['A']>0,:]

          A         B         C         D
a  0.542641 -0.958496  0.267296  0.497608
e  0.443511 -0.416248  0.835548  0.429152
f  0.085089 -0.715660 -0.253318  0.348267

In [158]:
df

          A         B         C         D
a  0.542641 -0.958496  0.267296  0.497608
b -0.002986 -0.550407 -0.603874  0.521061
c -0.661778 -0.823320  0.370720  0.906787
d -0.992103  0.024385  0.625242  0.225052
e  0.443511 -0.416248  0.835548  0.429152
f  0.085089 -0.715660 -0.253318  0.348267

In [290]:
#选择a行大于零，A列大于零
df.loc['a']>0 #a行大于零的所有列

A     True
B    False
C     True
D     True
Name: a, dtype: bool

In [292]:
df['A']>0  #A列大于零所有行

a     True
b    False
c    False
d    False
e     True
f     True
Name: A, dtype: bool

In [160]:
df.loc[df['A']>0,df.loc['a']>0]  #选择满足要求的行和列

          A         C         D
a  0.542641  0.267296  0.497608
e  0.443511  0.835548  0.429152
f  0.085089 -0.253318  0.348267

In [161]:
#选择a行大于零，b行小于零，A列大于零，B列小于零
df.loc[(df['A']>0)&(df['B']<0),(df.loc['a']>0)&(df.loc['b']<0)] #组合选择

          A         C
a  0.542641  0.267296
e  0.443511  0.835548
f  0.085089 -0.253318

In [164]:
df

          A         B         C         D
a  0.542641 -0.958496  0.267296  0.497608
b -0.002986 -0.550407 -0.603874  0.521061
c -0.661778 -0.823320  0.370720  0.906787
d -0.992103  0.024385  0.625242  0.225052
e  0.443511 -0.416248  0.835548  0.429152
f  0.085089 -0.715660 -0.253318  0.348267

In [167]:
df.loc[:,df.loc['a']==0.542641286533492] #选择a行满足要求所有列

          A
a  0.542641
b -0.002986
c -0.661778
d -0.992103
e  0.443511
f  0.085089

In [168]:
#对空值的选择和过滤
df1=df[df>0]
df1

          A         B         C         D
a  0.542641       NaN  0.267296  0.497608
b       NaN       NaN       NaN  0.521061
c       NaN       NaN  0.370720  0.906787
d       NaN  0.024385  0.625242  0.225052
e  0.443511       NaN  0.835548  0.429152
f  0.085089       NaN       NaN  0.348267

In [170]:
df1.isnull() #缺失值的判断

       A      B      C      D
a  False   True  False  False
b   True   True   True  False
c   True   True  False  False
d   True  False  False  False
e  False   True  False  False
f  False   True   True  False

In [171]:
df1.notnull() #缺失值的判断

       A      B      C     D
a   True  False   True  True
b  False  False  False  True
c  False  False   True  True
d  False   True   True  True
e   True  False   True  True
f   True  False  False  True

In [301]:
#A列和C列都是非空的所有行
df1['A'].notnull()&df1['C'].notnull()

a     True
b    False
c    False
d    False
e     True
f    False
dtype: bool

In [172]:
df1[df1['A'].notnull()&df1['C'].notnull()]

          A   B         C         D
a  0.542641 NaN  0.267296  0.497608
e  0.443511 NaN  0.835548  0.429152

In [303]:
df

          A         B         C         D
a  0.542641 -0.958496  0.267296  0.497608
b -0.002986 -0.550407 -0.603874  0.521061
c -0.661778 -0.823320  0.370720  0.906787
d -0.992103  0.024385  0.625242  0.225052
e  0.443511 -0.416248  0.835548  0.429152
f  0.085089 -0.715660 -0.253318  0.348267

In [178]:
df['E']=['one','one','two','two','three','three']
df

          A         B         C         D      E
a  0.542641 -0.958496  0.267296  0.497608    one
b -0.002986 -0.550407 -0.603874  0.521061    one
c -0.661778 -0.823320  0.370720  0.906787    two
d -0.992103  0.024385  0.625242  0.225052    two
e  0.443511 -0.416248  0.835548  0.429152  three
f  0.085089 -0.715660 -0.253318  0.348267  three

In [311]:
df['E']=='two'

a    False
b    False
c     True
d     True
e    False
f    False
Name: E, dtype: bool

In [179]:
#选择E列是two的所有行
df[df['E']=='two']

          A         B         C         D    E
c -0.661778 -0.823320  0.370720  0.906787  two
d -0.992103  0.024385  0.625242  0.225052  two

In [181]:
df[df.E.isin(['two','three'])] #选择第E列是two和three

          A         B         C         D      E
c -0.661778 -0.823320  0.370720  0.906787    two
d -0.992103  0.024385  0.625242  0.225052    two
e  0.443511 -0.416248  0.835548  0.429152  three
f  0.085089 -0.715660 -0.253318  0.348267  three

In [182]:
df

          A         B         C         D      E
a  0.542641 -0.958496  0.267296  0.497608    one
b -0.002986 -0.550407 -0.603874  0.521061    one
c -0.661778 -0.823320  0.370720  0.906787    two
d -0.992103  0.024385  0.625242  0.225052    two
e  0.443511 -0.416248  0.835548  0.429152  three
f  0.085089 -0.715660 -0.253318  0.348267  three

In [187]:
s1='one'
s1.endswith('e')  #python基础里面的字符串方法，只能处理当个字符

True

In [184]:
df.E.str.endswith('e') #字符串

a     True
b     True
c    False
d    False
e     True
f     True
Name: E, dtype: bool

In [194]:
df[df.E.str.endswith('e')]  #字符串序列的操作方法

          A         B         C         D      E
a  0.542641 -0.958496  0.267296  0.497608    one
b -0.002986 -0.550407 -0.603874  0.521061    one
e  0.443511 -0.416248  0.835548  0.429152  three
f  0.085089 -0.715660 -0.253318  0.348267  three

In [188]:
df

          A         B         C         D      E
a  0.542641 -0.958496  0.267296  0.497608    one
b -0.002986 -0.550407 -0.603874  0.521061    one
c -0.661778 -0.823320  0.370720  0.906787    two
d -0.992103  0.024385  0.625242  0.225052    two
e  0.443511 -0.416248  0.835548  0.429152  three
f  0.085089 -0.715660 -0.253318  0.348267  three

In [192]:
df.E

a      one
b      one
c      two
d      two
e    three
f    three
Name: E, dtype: object

In [195]:
#选择E列以t开头的所有行
df.E.map(lambda x:x.startswith('t')) #对每一个元素做映射

a    False
b    False
c     True
d     True
e     True
f     True
Name: E, dtype: bool

In [196]:
df[df.E.map(lambda x:x.startswith('t'))] #对字符串的操作

          A         B         C         D      E
c -0.661778 -0.823320  0.370720  0.906787    two
d -0.992103  0.024385  0.625242  0.225052    two
e  0.443511 -0.416248  0.835548  0.429152  three
f  0.085089 -0.715660 -0.253318  0.348267  three

In [203]:
def f(x):
    return x.startswith('t')&(len(x)<4)  
df[df.E.map(f)]   #可以实现复杂的操作 ，apply也ok

          A         B         C         D    E
c -0.661778 -0.823320  0.370720  0.906787  two
d -0.992103  0.024385  0.625242  0.225052  two

In [204]:
df.loc[df['E']=='two',:]

          A         B         C         D    E
c -0.661778 -0.823320  0.370720  0.906787  two
d -0.992103  0.024385  0.625242  0.225052  two

In [207]:
#map函数
def square(x) :            # 计算平方数
    return x ** 2
square(8)

64

In [210]:
a=[1,2,3,4]
list(map(square,a))   #实现向量化操作

[1, 4, 9, 16]

In [211]:
df

          A         B         C         D      E
a  0.542641 -0.958496  0.267296  0.497608    one
b -0.002986 -0.550407 -0.603874  0.521061    one
c -0.661778 -0.823320  0.370720  0.906787    two
d -0.992103  0.024385  0.625242  0.225052    two
e  0.443511 -0.416248  0.835548  0.429152  three
f  0.085089 -0.715660 -0.253318  0.348267  three

In [213]:
df['E']=df['E'].str.replace('o','s')
df

          A         B         C         D      E
a  0.542641 -0.958496  0.267296  0.497608    sne
b -0.002986 -0.550407 -0.603874  0.521061    sne
c -0.661778 -0.823320  0.370720  0.906787    tws
d -0.992103  0.024385  0.625242  0.225052    tws
e  0.443511 -0.416248  0.835548  0.429152  three
f  0.085089 -0.715660 -0.253318  0.348267  three

In [215]:
df['E']=df['E'].str.title()
df

          A         B         C         D      E
a  0.542641 -0.958496  0.267296  0.497608    Sne
b -0.002986 -0.550407 -0.603874  0.521061    Sne
c -0.661778 -0.823320  0.370720  0.906787    Tws
d -0.992103  0.024385  0.625242  0.225052    Tws
e  0.443511 -0.416248  0.835548  0.429152  Three
f  0.085089 -0.715660 -0.253318  0.348267  Three

### 索引设置

#### 序列的重新索引和插值

In [216]:
s=Series([3,4,5,6],index=['a','b','c','d']) #指定索引
s

a    3
b    4
c    5
d    6
dtype: int64

In [218]:
s.reindex(['a','d','e','f'])    #原索引值不在，引入缺失值

a    3.0
d    6.0
e    NaN
f    NaN
dtype: float64

In [220]:
s.reindex(['a','d','e','f'],fill_value=0) #原索引值不在，填充0

a    3
d    6
e    0
f    0
dtype: int64

In [222]:
s=Series(['a','b','c'],index=[0,2,4]) #index为数值，时间
s

0    a
2    b
4    c
dtype: object

In [223]:
s.reindex(range(6),fill_value='a') #插值，上采样

0    a
1    a
2    b
3    a
4    c
5    a
dtype: object

In [224]:
s

0    a
2    b
4    c
dtype: object

In [225]:
s.reindex(range(6),method='ffill') #重复操作，前向填充

0    a
1    a
2    b
3    b
4    c
5    c
dtype: object

In [226]:
s.reindex(range(6),method='bfill') #重复操作，后向填充

0      a
1      b
2      b
3      c
4      c
5    NaN
dtype: object

#### dataframe的重新索引和插值

In [227]:
data1=[[1, 2, 3],[4, 5, 6],[7, 8, 9]] #二维列表创建,二维元组
d1=DataFrame(data1,index=['a','b','c'],columns=['one','two','three'])
d1

   one  two  three
a    1    2      3
b    4    5      6
c    7    8      9

In [228]:
d1.reindex(['a','b','c','d']) #重索引行，引入缺失值

   one  two  three
a  1.0  2.0    3.0
b  4.0  5.0    6.0
c  7.0  8.0    9.0
d  NaN  NaN    NaN

In [24]:
d1.reindex(['a','b','c','d'],method='ffill') #重索引行，填充

   one  two  three
a    1    2      3
b    4    5      6
c    7    8      9
d    7    8      9

In [229]:
d1

   one  two  three
a    1    2      3
b    4    5      6
c    7    8      9

In [28]:
d1.reindex(columns=['one','two','three','four'],fill_value=0) #重索引列，引入缺失值

   one  two  three  four
a    1    2      3     0
b    4    5      6     0
c    7    8      9     0

In [29]:
d1.reindex?

In [ ]:
#对列进行填充，索引要单调递增或者递减

In [235]:
data1=[[1, 2, 3],[4, 5, 6],[7, 8, 9]] #二维列表创建,二维元组
d1=DataFrame(data1,index=['a','b','c'])
d1

   0  1  2
a  1  2  3
b  4  5  6
c  7  8  9

In [236]:
d1.reindex(columns=np.arange(4),method='ffill') #重索引列,跟版本的有关

   0  1  2  3
a  1  2  3  3
b  4  5  6  6
c  7  8  9  9

#### 设置索引

In [237]:
d2=pd.read_excel(r'D:\CDA\Dataclearing\NEW-就业班\test.xlsx') #读
d2.head(5) #查看前5行

    姓名  课程  成绩
0   孙志  英语  75
1   孙志  语文  58
2   孙志  英语  90
3   孙志  数学  89
4  赵昀艳  数学  28

In [238]:
d3=d2.set_index('姓名')
d3.head()

     课程  成绩
姓名
孙志   英语  75
孙志   语文  58
孙志   英语  90
孙志   数学  89
赵昀艳  数学  28

#### 恢复默认索引

In [239]:
d3.reset_index()

      姓名  课程  成绩
0     孙志  英语  75
1     孙志  语文  58
2     孙志  英语  90
3     孙志  数学  89
4    赵昀艳  数学  28
..   ...  ..  ..
195  李伟艳  数学  30
196  李琛志  数学  97
197  赵伟艳  英语  96
198  李东艳  语文  26
199  钱昀艳  语文  24

[200 rows x 3 columns]